MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KL200/mcu.h
extern volatile T3CONBITS T3CONbits __attribute__((__sfr__));

#define CCP1CON CCP1CON
extern volatile uint16_t CCP1CON __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CONBITS {
  union {
    struct {
      uint16_t CCPM:4;
      uint16_t DCB:2;
    };
    struct {
      uint16_t CCPM0:1;
      uint16_t CCPM1:1;
      uint16_t CCPM2:1;
      uint16_t CCPM3:1;
      uint16_t DCB0:1;
      uint16_t DCB1:1;
    };
    struct {
      uint16_t CCP1M:4;
      uint16_t DC1B:2;
    };
    struct {
      uint16_t CCP1M0:1;
      uint16_t CCP1M1:1;
      uint16_t CCP1M2:1;
      uint16_t CCP1M3:1;
      uint16_t DC1B0:1;
      uint16_t DC1B1:1;
    };
  };
} CCP1CONBITS;
extern volatile CCP1CONBITS CCP1CONbits __attribute__((__sfr__));

#define CCPR1L CCPR1L
extern volatile uint8_t CCPR1L __attribute__((__sfr__));
#define CCPR1H CCPR1H
extern volatile uint8_t CCPR1H __attribute__((__sfr__));
#define CCP2CON CCP2CON
extern volatile uint16_t CCP2CON __attribute__((__sfr__));
__extension__ typedef struct tagCCP2CONBITS {
  union {
    struct {
      uint16_t CCPM:4;
      uint16_t DCB:2;
    };
    struct {
      uint16_t CCPM0:1;
      uint16_t CCPM1:1;
      uint16_t CCPM2:1;
      uint16_t CCPM3:1;
      uint16_t DCB0:1;
      uint16_t DCB1:1;
    };
    struct {
      uint16_t CCP2M:4;
      uint16_t DC2B:2;
    };
    struct {
      uint16_t CCP2M0:1;
      uint16_t CCP2M1:1;
      uint16_t CCP2M2:1;
      uint16_t CCP2M3:1;
      uint16_t DC2B0:1;
      uint16_t DC2B1:1;
    };
  };
} CCP2CONBITS;
extern volatile CCP2CONBITS CCP2CONbits __attribute__((__sfr__));

#define CCPR2L CCPR2L
extern volatile uint8_t CCPR2L __attribute__((__sfr__));
#define CCPR2H CCPR2H
extern volatile uint8_t CCPR2H __attribute__((__sfr__));
#define SPI1BUF SPI1BUF
extern volatile uint16_t SPI1BUF __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BUFBITS {
  union {
    struct {
      uint16_t SSPBUF:8;
    };
    struct {
      uint16_t SPI1BUF:8;
    };
  };
} SPI1BUFBITS;
extern volatile SPI1BUFBITS SPI1BUFbits __attribute__((__sfr__));

#define SSP1BUF SSP1BUF
extern volatile uint16_t SSP1BUF __attribute__((__sfr__));
__extension__ typedef struct tagSSP1BUFBITS {
  union {
    struct {
      uint16_t SSPBUF:8;
    };
    struct {
      uint16_t SPI1BUF:8;
    };
  };
} SSP1BUFBITS;
extern volatile SSP1BUFBITS SSP1BUFbits __attribute__((__sfr__));

#define SSP1CON1 SSP1CON1
extern volatile uint16_t SSP1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSSP1CON1BITS {
  union {
    struct {
      uint16_t SSPM:4;
      uint16_t CKP:1;
      uint16_t SSPEN:1;
      uint16_t SSPOV:1;
      uint16_t WCOL:1;
    };
    struct {
      uint16_t SSPM0:1;
      uint16_t SSPM1:1;
      uint16_t SSPM2:1;
      uint16_t SSPM3:1;
    };
  };
} SSP1CON1BITS;
extern volatile SSP1CON1BITS SSP1CON1bits __attribute__((__sfr__));

#define SSP1CON2 SSP1CON2
extern volatile uint16_t SSP1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSSP1CON2BITS {
  union {
    struct {
      uint16_t SEN:1;
      uint16_t RSEN:1;
      uint16_t PEN:1;
      uint16_t RCEN:1;
      uint16_t ACKEN:1;
      uint16_t ACKDT:1;
      uint16_t ACKSTAT:1;
      uint16_t GCEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t ADMSK:5;
    };
    struct {
      uint16_t :1;
      uint16_t ADMSK1:1;
      uint16_t ADMSK2:1;
      uint16_t ADMSK3:1;
      uint16_t ADMSK4:1;
      uint16_t ADMSK5:1;
    };
  };
} SSP1CON2BITS;
extern volatile SSP1CON2BITS SSP1CON2bits __attribute__((__sfr__));

#define SSP1CON3 SSP1CON3
extern volatile uint16_t SSP1CON3 __attribute__((__sfr__));
typedef struct tagSSP1CON3BITS {
  uint16_t DHEN:1;
  uint16_t AHEN:1;
  uint16_t SBCDE:1;
  uint16_t SDAHT:1;
  uint16_t BOEN:1;
  uint16_t SCIE:1;
  uint16_t PCIE:1;
  uint16_t ACKTIM:1;
} SSP1CON3BITS;
extern volatile SSP1CON3BITS SSP1CON3bits __attribute__((__sfr__));

#define SSP1STAT SSP1STAT
extern volatile uint16_t SSP1STAT __attribute__((__sfr__));
__extension__ typedef struct tagSSP1STATBITS {
  union {
    struct {
      uint16_t BF:1;
      uint16_t UA:1;
      uint16_t R_NOT_W:1;
      uint16_t S:1;
      uint16_t P:1;
      uint16_t D_NOT_A:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
    };
    struct {
      uint16_t :2;
      uint16_t R_W:1;
      uint16_t :2;
      uint16_t D_A:1;
    };
    struct {
      uint16_t :2;
      uint16_t NOT_W:1;
      uint16_t :2;
      uint16_t NOT_A:1;
    };
    struct {
      uint16_t :2;
      uint16_t NOT_WRITE:1;
      uint16_t :2;
      uint16_t NOT_ADDRESS:1;
    };
    struct {
      uint16_t :2;
      uint16_t READ_WRITE:1;
      uint16_t :2;
      uint16_t DATA_ADDRESS:1;
    };
    struct {
      uint16_t :2;
      uint16_t I2C_READ:1;
      uint16_t I2C_START:1;
      uint16_t I2C_STOP:1;
      uint16_t I2C_DAT:1;
    };
  };
} SSP1STATBITS;
extern volatile SSP1STATBITS SSP1STATbits __attribute__((__sfr__));

#define I2C1ADD I2C1ADD
extern volatile uint16_t I2C1ADD __attribute__((__sfr__));
__extension__ typedef struct tagI2C1ADDBITS {
  union {
    struct {
      uint16_t SSPADD:8;
    };
    struct {
      uint16_t I2CADD:8;
    };
  };
} I2C1ADDBITS;
extern volatile I2C1ADDBITS I2C1ADDbits __attribute__((__sfr__));

#define SSP1ADD SSP1ADD
extern volatile uint16_t SSP1ADD __attribute__((__sfr__));
__extension__ typedef struct tagSSP1ADDBITS {
  union {
    struct {
      uint16_t SSPADD:8;
    };
    struct {
      uint16_t I2CADD:8;
    };
  };
} SSP1ADDBITS;
extern volatile SSP1ADDBITS SSP1ADDbits __attribute__((__sfr__));

#define I2C1MSK I2C1MSK
extern volatile uint16_t I2C1MSK __attribute__((__sfr__));
__extension__ typedef struct tagI2C1MSKBITS {
  union {
    struct {
      uint16_t MSK0:1;
      uint16_t MSK1:1;
      uint16_t MSK2:1;
      uint16_t MSK3:1;
      uint16_t MSK4:1;
      uint16_t MSK5:1;
      uint16_t MSK6:1;
      uint16_t MSK7:1;
    };
    struct {
      uint16_t AMSK:8;
    };
  };
} I2C1MSKBITS;
extern volatile I2C1MSKBITS I2C1MSKbits __attribute__((__sfr__));

#define SSP1MSK SSP1MSK
extern volatile uint16_t SSP1MSK __attribute__((__sfr__));
__extension__ typedef struct tagSSP1MSKBITS {
  union {
    struct {
      uint16_t MSK0:1;
      uint16_t MSK1:1;
      uint16_t MSK2:1;
      uint16_t MSK3:1;
      uint16_t MSK4:1;
      uint16_t MSK5:1;
      uint16_t MSK6:1;
      uint16_t MSK7:1;
    };
    struct {
      uint16_t AMSK:8;
    };
  };
} SSP1MSKBITS;
extern volatile SSP1MSKBITS SSP1MSKbits __attribute__((__sfr__));


/* Generic structure of entire SFR area for each UART module */
typedef struct tagUART {
        uint16_t uxmode;
        uint16_t uxsta;
        uint16_t uxtxreg;
        uint16_t uxrxreg;
        uint16_t uxbrg;
} UART, *PUART;

#define UxMODEBITS U1MODEBITS
#define UxSTABITS U1STABITS
#define UxTXREGBITS U1TXREGBITS
#define UxRXREGBITS U1RXREGBITS
#define UxBRGBITS U1BRGBITS

#define UART1 UART1
extern volatile UART UART1 __attribute__((__sfr__));

#define U1MODE U1MODE
extern volatile uint16_t U1MODE __attribute__((__sfr__));
__extension__ typedef struct tagU1MODEBITS {
  union {
    struct {
      uint16_t STSEL:1;
      uint16_t PDSEL:2;
      uint16_t BRGH:1;
      uint16_t RXINV:1;
      uint16_t ABAUD:1;
      uint16_t LPBACK:1;
      uint16_t WAKE:1;
      uint16_t UEN:2;
      uint16_t :1;
      uint16_t RTSMD:1;
      uint16_t IREN:1;
      uint16_t USIDL:1;
      uint16_t :1;
      uint16_t UARTEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t PDSEL0:1;
      uint16_t PDSEL1:1;
      uint16_t :5;
      uint16_t UEN0:1;
      uint16_t UEN1:1;
    };
  };
} U1MODEBITS;
extern volatile U1MODEBITS U1MODEbits __attribute__((__sfr__));

#define U1STA U1STA
extern volatile uint16_t U1STA __attribute__((__sfr__));
__extension__ typedef struct tagU1STABITS {
  union {
    struct {
      uint16_t URXDA:1;
      uint16_t OERR:1;
      uint16_t FERR:1;
      uint16_t PERR:1;
      uint16_t RIDLE:1;
      uint16_t ADDEN:1;
      uint16_t URXISEL:2;
      uint16_t TRMT:1;
      uint16_t UTXBF:1;
      uint16_t UTXEN:1;
      uint16_t UTXBRK:1;
      uint16_t :1;
      uint16_t UTXISEL0:1;
      uint16_t UTXINV:1;
      uint16_t UTXISEL1:1;
    };
    struct {
      uint16_t :6;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
    };
  };
} U1STABITS;
extern volatile U1STABITS U1STAbits __attribute__((__sfr__));

#define U1TXREG U1TXREG
extern volatile uint16_t U1TXREG __attribute__((__sfr__));
typedef struct tagU1TXREGBITS {
  uint16_t UTXREG0:1;
  uint16_t UTXREG1:1;
  uint16_t UTXREG2:1;
  uint16_t UTXREG3:1;
  uint16_t UTXREG4:1;
  uint16_t UTXREG5:1;
  uint16_t UTXREG6:1;
  uint16_t UTXREG7:1;
  uint16_t UTXREG8:1;
} U1TXREGBITS;
extern volatile U1TXREGBITS U1TXREGbits __attribute__((__sfr__));

#define U1RXREG U1RXREG
extern volatile uint16_t U1RXREG __attribute__((__sfr__));
typedef struct tagU1RXREGBITS {
  uint16_t URXREG0:1;
  uint16_t URXREG1:1;
  uint16_t URXREG2:1;
  uint16_t URXREG3:1;
  uint16_t URXREG4:1;
  uint16_t URXREG5:1;
  uint16_t URXREG6:1;
  uint16_t URXREG7:1;
  uint16_t URXREG8:1;
} U1RXREGBITS;
extern volatile U1RXREGBITS U1RXREGbits __attribute__((__sfr__));

#define U1BRG U1BRG
extern volatile uint16_t U1BRG __attribute__((__sfr__));
#define TRISA TRISA
extern volatile uint16_t TRISA __attribute__((__sfr__));
typedef struct tagTRISABITS {
  uint16_t TRISA0:1;
  uint16_t TRISA1:1;
  uint16_t TRISA2:1;
  uint16_t TRISA3:1;
  uint16_t TRISA4:1;
  uint16_t :1;
  uint16_t TRISA6:1;
} TRISABITS;
extern volatile TRISABITS TRISAbits __attribute__((__sfr__));

#define PORTA PORTA
extern volatile uint16_t PORTA __attribute__((__sfr__));
typedef struct tagPORTABITS {
  uint16_t RA0:1;
  uint16_t RA1:1;
  uint16_t RA2:1;
  uint16_t RA3:1;
  uint16_t RA4:1;
  uint16_t RA5:1;
  uint16_t RA6:1;
} PORTABITS;
extern volatile PORTABITS PORTAbits __attribute__((__sfr__));

#define LATA LATA
extern volatile uint16_t LATA __attribute__((__sfr__));
typedef struct tagLATABITS {
  uint16_t LATA0:1;
  uint16_t LATA1:1;
  uint16_t LATA2:1;
  uint16_t LATA3:1;
  uint16_t LATA4:1;
  uint16_t :1;
  uint16_t LATA6:1;
} LATABITS;
