MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F08KL200/mcu.h
/* T1CON */
#define _TCS T1CONbits.TCS
#define _TSYNC T1CONbits.TSYNC
#define _TCKPS T1CONbits.TCKPS
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */
#define _TECS T1CONbits.TECS
#define _TSIDL T1CONbits.TSIDL
#define _TON T1CONbits.TON
#define _TCKPS0 T1CONbits.TCKPS0
#define _TCKPS1 T1CONbits.TCKPS1
#define _TECS0 T1CONbits.TECS0
#define _TECS1 T1CONbits.TECS1
#define _T1ECS T1CONbits.T1ECS
#define _T1ECS0 T1CONbits.T1ECS0
#define _T1ECS1 T1CONbits.T1ECS1

/* T2CON */
#define _T2CKPS T2CONbits.T2CKPS
#define _TMR2ON T2CONbits.TMR2ON
#define _T2OUTPS T2CONbits.T2OUTPS
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TON cannot be defined because it is used by more than one SFR */
#define _TOUTPS T2CONbits.TOUTPS
#define _T2CKPS0 T2CONbits.T2CKPS0
#define _T2CKPS1 T2CONbits.T2CKPS1
#define _T2OUTPS0 T2CONbits.T2OUTPS0
#define _T2OUTPS1 T2CONbits.T2OUTPS1
#define _T2OUTPS2 T2CONbits.T2OUTPS2
#define _T2OUTPS3 T2CONbits.T2OUTPS3

/* T3GCON */
#define _T3GSS T3GCONbits.T3GSS
#define _T3GVAL T3GCONbits.T3GVAL
#define _T3GGO T3GCONbits.T3GGO
#define _T3GSPM T3GCONbits.T3GSPM
#define _T3GTM T3GCONbits.T3GTM
#define _T3GPOL T3GCONbits.T3GPOL
#define _TMR3GE T3GCONbits.TMR3GE
#define _T3GSS0 T3GCONbits.T3GSS0
#define _T3GSS1 T3GCONbits.T3GSS1
#define _NOT_T3DONE T3GCONbits.NOT_T3DONE
#define _TGSS T3GCONbits.TGSS
#define _TGVAL T3GCONbits.TGVAL
#define _TGGO T3GCONbits.TGGO
#define _TGSE T3GCONbits.TGSE
#define _TGTM T3GCONbits.TGTM
#define _TGPOL T3GCONbits.TGPOL
/* Bitname _TGATE cannot be defined because it is used by more than one SFR */

/* T3CON */
#define _TMR3ON T3CONbits.TMR3ON
#define _NOT_T3SYNC T3CONbits.NOT_T3SYNC
#define _T3OSCEN T3CONbits.T3OSCEN
#define _T3CKPS T3CONbits.T3CKPS
#define _TMR3CS T3CONbits.TMR3CS
/* Bitname _TON cannot be defined because it is used by more than one SFR */
#define _NOT_TSYNC T3CONbits.NOT_TSYNC
/* Bitname _SOSCEN cannot be defined because it is used by more than one SFR */
/* Bitname _TCKPS cannot be defined because it is used by more than one SFR */
/* Bitname _TCS cannot be defined because it is used by more than one SFR */
#define _T3CKPS0 T3CONbits.T3CKPS0
#define _T3CKPS1 T3CONbits.T3CKPS1
#define _TMR3CS0 T3CONbits.TMR3CS0
#define _TMR3CS1 T3CONbits.TMR3CS1

/* CCP1CON */
/* Bitname _CCPM cannot be defined because it is used by more than one SFR */
/* Bitname _DCB cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM3 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB1 cannot be defined because it is used by more than one SFR */
#define _CCP1M CCP1CONbits.CCP1M
#define _DC1B CCP1CONbits.DC1B
#define _CCP1M0 CCP1CONbits.CCP1M0
#define _CCP1M1 CCP1CONbits.CCP1M1
#define _CCP1M2 CCP1CONbits.CCP1M2
#define _CCP1M3 CCP1CONbits.CCP1M3
#define _DC1B0 CCP1CONbits.DC1B0
#define _DC1B1 CCP1CONbits.DC1B1

/* CCP2CON */
/* Bitname _CCPM cannot be defined because it is used by more than one SFR */
/* Bitname _DCB cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM0 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM1 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM2 cannot be defined because it is used by more than one SFR */
/* Bitname _CCPM3 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _DCB1 cannot be defined because it is used by more than one SFR */
#define _CCP2M CCP2CONbits.CCP2M
#define _DC2B CCP2CONbits.DC2B
#define _CCP2M0 CCP2CONbits.CCP2M0
#define _CCP2M1 CCP2CONbits.CCP2M1
#define _CCP2M2 CCP2CONbits.CCP2M2
#define _CCP2M3 CCP2CONbits.CCP2M3
#define _DC2B0 CCP2CONbits.DC2B0
#define _DC2B1 CCP2CONbits.DC2B1

/* SPI1BUF */
#define _SSPBUF SPI1BUFbits.SSPBUF
#define _SPI1BUF SPI1BUFbits.SPI1BUF

/* SSP1CON1 */
#define _SSPM SSP1CON1bits.SSPM
#define _CKP SSP1CON1bits.CKP
#define _SSPEN SSP1CON1bits.SSPEN
#define _SSPOV SSP1CON1bits.SSPOV
#define _WCOL SSP1CON1bits.WCOL
#define _SSPM0 SSP1CON1bits.SSPM0
#define _SSPM1 SSP1CON1bits.SSPM1
#define _SSPM2 SSP1CON1bits.SSPM2
#define _SSPM3 SSP1CON1bits.SSPM3

/* SSP1CON2 */
#define _SEN SSP1CON2bits.SEN
#define _RSEN SSP1CON2bits.RSEN
#define _PEN SSP1CON2bits.PEN
#define _RCEN SSP1CON2bits.RCEN
#define _ACKEN SSP1CON2bits.ACKEN
#define _ACKDT SSP1CON2bits.ACKDT
#define _ACKSTAT SSP1CON2bits.ACKSTAT
#define _GCEN SSP1CON2bits.GCEN
#define _ADMSK SSP1CON2bits.ADMSK
#define _ADMSK1 SSP1CON2bits.ADMSK1
#define _ADMSK2 SSP1CON2bits.ADMSK2
#define _ADMSK3 SSP1CON2bits.ADMSK3
#define _ADMSK4 SSP1CON2bits.ADMSK4
#define _ADMSK5 SSP1CON2bits.ADMSK5

/* SSP1CON3 */
#define _DHEN SSP1CON3bits.DHEN
#define _AHEN SSP1CON3bits.AHEN
#define _SBCDE SSP1CON3bits.SBCDE
#define _SDAHT SSP1CON3bits.SDAHT
#define _BOEN SSP1CON3bits.BOEN
#define _SCIE SSP1CON3bits.SCIE
#define _PCIE SSP1CON3bits.PCIE
#define _ACKTIM SSP1CON3bits.ACKTIM

/* SSP1STAT */
#define _BF SSP1STATbits.BF
#define _UA SSP1STATbits.UA
#define _R_NOT_W SSP1STATbits.R_NOT_W
#define _S SSP1STATbits.S
#define _P SSP1STATbits.P
#define _D_NOT_A SSP1STATbits.D_NOT_A
#define _CKE SSP1STATbits.CKE
#define _SMP SSP1STATbits.SMP
#define _R_W SSP1STATbits.R_W
#define _D_A SSP1STATbits.D_A
#define _NOT_W SSP1STATbits.NOT_W
#define _NOT_A SSP1STATbits.NOT_A
#define _NOT_WRITE SSP1STATbits.NOT_WRITE
#define _NOT_ADDRESS SSP1STATbits.NOT_ADDRESS
#define _READ_WRITE SSP1STATbits.READ_WRITE
#define _DATA_ADDRESS SSP1STATbits.DATA_ADDRESS
#define _I2C_READ SSP1STATbits.I2C_READ
#define _I2C_START SSP1STATbits.I2C_START
#define _I2C_STOP SSP1STATbits.I2C_STOP
#define _I2C_DAT SSP1STATbits.I2C_DAT

/* I2C1ADD */
#define _SSPADD I2C1ADDbits.SSPADD
#define _I2CADD I2C1ADDbits.I2CADD

/* I2C1MSK */
#define _MSK0 I2C1MSKbits.MSK0
#define _MSK1 I2C1MSKbits.MSK1
#define _MSK2 I2C1MSKbits.MSK2
#define _MSK3 I2C1MSKbits.MSK3
#define _MSK4 I2C1MSKbits.MSK4
#define _MSK5 I2C1MSKbits.MSK5
#define _MSK6 I2C1MSKbits.MSK6
#define _MSK7 I2C1MSKbits.MSK7
#define _AMSK I2C1MSKbits.AMSK

